[
  {
    "name": "First Steps 2019",
    "description": "",
    "image": "first-steps.jpg",
    "pa": "Stefan Gehrig",
    "duration": "05.08.2019 - 09.08.2019",
    "technologies": [
      "Guidelines",
      "Swisscom",
      "Arbeiten im Team"
    ],
    "icon": "foot-print"
  },
  {
    "name": "ICT Boot Camp im Lernenden Center XPhone",
    "description": "In diesem Projekt habe ich die Möglichkeit gehabt, viele neue Dinge zu lernen. Ich habe mir während des Projektes ein sehr breites aber dennoch detailliertes Wissen über Netzwerke angeeignet.\nAufbau Windows Domain:\nIch bin nun in der Lage ohne fremde Hilfe eine simple Windows Domain zu erstellen und zu konfigurieren. Ausserdem habe ich nun ein Grundverständnis für die verschiedenen Dienste, welche für eine Windows Domain benötigt werden.\nDokumentation und Wissenssicherung:\nIm Verlauf des Projektes habe ich einige Dokumentationen verschiedener Art verfasst. Ich habe die verschiedenen Arten von Dokumentationen kennengelernt und habe mit Vorlagen gearbeitet. Die von mir geschriebenen Dokumentationen sind nun in Benutzung für die Ausbildung von anderen Lehrlingen in diesem Projekt.",
    "image": "ict-bootcamp.jpg",
    "pa": "Andreas Raschle",
    "duration": "12.08.2019 - 28.02.2020",
    "technologies": [
      "Windows Domain",
      "Dokumentation",
      "Wissenssicherung"
    ],
    "icon": "wan"
  },
  {
    "name": "PHP / Javascript für Directory Dienste (xml to LDAP)",
    "description": "In diesem Projekt habe ich ein Tool entwickelt, welches den Namen eines Anrufers aus eine Datenbank abfragt und diesen dann auf dem Telefon des Angerufenen anzeigt.\n\nIch habe eigenständig gelernt mit PHP zu arbeiten:\n- Logging Funktion in Lokale Files\n- Externe LDAP Abfragen\n- Konfigurationsfunktion mit Config Files\n- Testmethoden entwickelt\n- Inbetriebnahme PHP auf IIS\n- Rufnummer Normalisierung\n- Fehlerbehandlung\n- Dokumentation im Programm Code\n\nIch habe während des Projektes gelernt, wie ich eine Datenbank über LDAP einbinden kann:\n- Verbindungsaufbau\n- Authentifizierung\n- Abfragen mit spezifischen Suchfiltern\n- Antwortauswertung\n\nApplikationsprojekt nach IPERKA planen und durchführen:\n- Über LDAP informiert\n- Für PHP Entschieden\n- Schema gezeichnet",
    "image": "ldap.jpg",
    "pa": "Andreas Raschle",
    "duration": "01.03.2020 - 12.04.2020",
    "technologies": [
      "PHP",
      "Javascript",
      "LDAP",
      "IPERKA"
    ],
    "icon": "phone-voip"
  },
  {
    "name": "Unterstütze ein Startup bei der Entwicklung einer Blockchain Plattform",
    "description": "In diesem Projekt habe ich eine Java Library entwickelt, welche das Testen der Aktienplattform Daura sehr vereinfacht.\nWährend des Projektes habe ich sehr viel neues Gelernt:\nDa diese Library für Testing entwickelt wurde, habe ich auch sehr viel mit manuellem testing zutun gehabt und so gelernt, was es bedeutet effizient und gründlich zu testen.\nIch habe auch gelernt wie man eine Applikation entwickelt und die Versionierung mit einem Repository wie Github im Auge behält.\nAm Schluss habe ich auch sehr viel Erfahrung mit Code Dokumentation gemacht und gelernt, wie man eine verständliche Dokumentation verfasst.\nAls Kleinen Bonus habe ich auch gelernt, wie man eine einfache Javadoc erstellt.\nAlles in allem habe ich in diesem Projekt extrem viele neue Skills erarbeitet.",
    "image": "daura.jpg",
    "pa": "Alexandra Sowa",
    "duration": "02.06.2020 - 30.12.2020",
    "technologies": [
      "Java",
      "Javascript",
      "Node",
      "Selenium",
      "Code Documentation",
      "Git",
      "Test-Automation",
      "Testing",
      "Englisch"
    ],
    "icon": "robot-confused-outline"
  },
  {
    "name": "Young Professional: DevOps Engineer ESC Managed Services Linux Team",
    "description": "In diesem Projekt habe ich alle möglichen aufgaben rund um Linuxserver einrichten bis zu Linux Server Monitoren gelernt.\nWährend des Projektes habe ich ein Script überarbeitet welches die Grundkonfigurationen eines RHEL Servers unserer Umgebung entsprechend setzt.Des weiteren habe ich eine Monitoring Lösung für die logs implementiert und die Implementation dementsprechend dokumentiert.Als Hauptaufgabe habe ich ein POC für den Microsoft ATP auf linux durchgeführt und dem Team vorgestellt.\nAlles in allem habe ich in diesem Projekt sehr viel erfahrung mit Linux gemacht.",
    "image": "rhel.jpg",
    "pa": "Giancarlo Morena",
    "duration": "04.01.2021 - 30.07.2021",
    "technologies": [
      "Bash",
      "RHEL",
      "Monitoring",
      "Logging",
      "Docker",
      "Dokumentation",
      "Git (Gitlab)",
      "CI-Pipelines",
      "Microsoft Defender ATP",
      "Grafana"
    ],
    "icon": "penguin"
  },
  {
    "name": "Applikationsentwickler*in beim Nex-CC",
    "description": "Während meiner zeit in diesem Projekt habe ich bei der Entwicklung des Interview Planning Tools mitgeholfen. Ich habe gelernt wie man eine Vue App aufbaut und wie ein Java Springboot backend geschrieben wird. Im Projekt wurde nach scrum gearbeitet, wodurch ich mit den biweekly sprint meetings die Scrum-Arbeitsweise gut kennen lernen konnte. Die Aufträge wurden über Jira verwaltet, so habe ich auch einen einblick in die möglichkeiten von Jira erhalten.\nIch habe mich im laufe des Projektes auf die Microsoft Graph API spezialisiert und schlussendlich bei der implementierung von Kalender Events einen grossen teil geleistet.\nAlles in allem habe ich in diesem Projekt sehr viel erfahrung mit Vue und Java gemacht.",
    "image": "interview1.jpg",
    "pa": "Jan Herren",
    "duration": "01.08.2021 - 31.01.2022",
    "technologies": [
      "Vue",
      "Java",
      "Springboot",
      "Jira",
      "Microsoft Graph API",
      "Typescript",
      "Git",
      "Scrum"
    ],
    "icon": "keyboard-outline"
  },
  {
    "name": "Applikationsentwickler und Produkt Owner im NexCC",
    "description": "",
    "image": "interview2.jpg",
    "pa": "Urs Gloggner",
    "duration": "31.01.2022 - 31.08.2022",
    "technologies": [
      "Vue",
      "Java",
      "Springboot",
      "Jira",
      "Microsoft Graph API",
      "Typescript",
      "Git",
      "Scrum",
      "Projektmanagement"
    ],
    "icon": "shape"
  }
]